In [25]:
import os
import requests
import pandas as pd
import numpy as np
import re
from sklearn.model_selection import train_test_split
import nltk, spacy
from nltk.corpus import stopwords
from groq import Groq
import os
from dotenv import load_dotenv

In [26]:
DATA_PATH = "spider_text_sql.csv"
load_dotenv()

GROQ_API_KEY =  os.getenv("GROQ_API_KEY")
MODEL = "llama-3.3-70b-versatile"

headers = {
    "Authorization": f"Bearer {GROQ_API_KEY}",
    "Content-Type": "application/json"
}
client = Groq (
    api_key=GROQ_API_KEY
)

In [27]:
df = pd.read_csv(DATA_PATH)
print("Columns:", df.columns)

question_col = "text_query"   # change if needed
sql_col = "sql_command"

df = df.dropna(subset=[question_col, sql_col])

Columns: Index(['text_query', 'sql_command'], dtype='object')

In [28]:
nltk.download("stopwords")
STOPWORDS = set(stopwords.words("english"))

nlp = spacy.load("en_core_web_sm")

def preprocess_question(text: str) -> str:
    doc = nlp(str(text).lower())
    return " ".join([tok.lemma_ for tok in doc if tok.text not in STOPWORDS])

def normalize_sql(sql: str) -> str:
    return re.sub(r"\\s+", " ", str(sql).strip())

df["question_clean"] = df[question_col].apply(preprocess_question)
df["sql_clean"] = df[sql_col].apply(normalize_sql)

train_df, val_df = train_test_split(df, test_size=0.1, random_state=42)

[nltk_data] Downloading package stopwords to C:\Users\Luka
[nltk_data]     Krstic\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

In [29]:
def groq_generate(prompt: str) -> str:
    chat_completion = client.chat.completions.create(
        messages=[
            {
                "role": "system",
                "content": "You are a helpful assistant that converts English questions into SQL queries and only output the SQL, without explaining and without new lines, just generate the whole query."
            },
            {
                "role": "user",
                "content": prompt,
            }
        ],
            model=MODEL,
    )
    return chat_completion.choices[0].message.content

def predict_sql(question: str) -> str:
    prompt = f"Translate the following question into SQL, and only output the SQL, without explaining and without new lines, just the whole query:\n\nQuestion: {question}\nSQL:"
    return groq_generate(prompt)

In [30]:
preds, refs = [], []
def clean_sql(q: str) -> str:
    # remove triple backticks and optional "sql"
    q = re.sub(r"```sql|```", "", q)
    # strip leading/trailing whitespace
    q = q.strip()
    return q

for i, row in val_df.head(50).iterrows():  # limit to 50 for demo
    q = row["question_clean"]
    gold = row["sql_clean"]
    try:
        pred = predict_sql(q)
    except Exception as e:
        print("Error:", e)
        pred = ""
    preds.append(pred)
    refs.append(gold)

preds = [clean_sql(sql) for sql in preds]

In [31]:
print(preds)
print(refs)

['SELECT id FROM order_item WHERE product_id = 11', 'SELECT MIN(estimate) AS low, MAX(estimate) AS high FROM film_market', "SELECT name, account_balance FROM customer WHERE name LIKE '% %'", 'SELECT name, subject FROM table_name', 'SELECT entry_name FROM catalog WHERE price_usd = ( SELECT MAX(price_usd) FROM catalog )', 'SELECT name FROM product WHERE id IN (SELECT product_id FROM event GROUP BY product_id HAVING COUNT(DISTINCT event_id) >= 2)', 'SELECT name FROM club_player WHERE position = "right wing"', 'SELECT COUNT(DISTINCT budget_code) FROM table_name;', 'SELECT name FROM patient WHERE room = 111 AND treatment IS NOT NULL', "SELECT flight_number FROM flights WHERE airline = 'United Airlines'", 'SELECT * FROM employees WHERE salary BETWEEN 8000 AND 12000 AND commission IS NULL AND department_id = 40;', 'SELECT * FROM competitions WHERE name = "1994 FIFA World Cup qualification"', 'SELECT song_name, singer, AVG(age) FROM singers JOIN songs ON singers.singer_id = songs.singer_id GROUP BY song_name, singer', 'SELECT MAX(cost) FROM treatments WHERE date = (SELECT MAX(date) FROM treatments)', "SELECT code, role FROM employees WHERE role = 'employee'", 'SELECT phone FROM table_name WHERE accreditation_level = 3', 'SELECT name FROM conductors WHERE orchestra_count = 1', 'SELECT username, password, user, common, role FROM users', 'SELECT COUNT(DISTINCT position) FROM table_name', 'SELECT product_type_code FROM products GROUP BY product_type_code HAVING COUNT(DISTINCT product_id) >= 2', 'SELECT name FROM scientists WHERE project IS NOT NULL', 'SELECT name FROM pilots WHERE age >= 25', 'SELECT statement_id, statement_detail, account_detail, account FROM statement_table;', 'SELECT role, COUNT(*) as number_of_employees FROM employees GROUP BY role', "SELECT email_address FROM customers WHERE first_name = 'Carole' AND date_of_birth IS NOT NULL", "SELECT name FROM instructor WHERE course='C Programming'", 'SELECT name FROM teacher WHERE age IN (32, 33)', "SELECT COUNT(*) FROM video_games WHERE type = 'massively multiplayer online game'", 'SELECT first_name FROM professors WHERE id IN (SELECT professor_id FROM classes)', 'SELECT AVG(enrollment) FROM university WHERE founding_year = 1850', 'SELECT location FROM gas_station_company WHERE market_value > 100;', "SELECT name FROM train WHERE station_location = 'London'", 'SELECT nationality, COUNT(*) FROM hosts GROUP BY nationality', 'SELECT AVG(rating) FROM reviewer', 'SELECT id, version, type, code, template FROM table_name;', 'SELECT customer_status_code, COUNT(classify_way) AS num_classify_ways FROM customer_classifications GROUP BY customer_status_code', 'SELECT name, capital, country FROM countries', 'SELECT AVG(enrollment) FROM school', 'SELECT AVG(age) FROM students GROUP BY gender;', 'SELECT COUNT(*) FROM entrepreneurs', "SELECT firstname, deptno FROM emp WHERE lastname = 'mcewen'", 'SELECT first_name FROM teacher WHERE classroom = 110', 'SELECT first_name, middle_name, last_name, id FROM students WHERE degree_program = 2 AND semester = 1', "SELECT s.name, a.amenity FROM students s JOIN dorms d ON s.dorm_id = d.id JOIN amenities a ON d.amenity_id = a.id WHERE s.last_name = 'smith'", "SELECT COUNT(assign_scientist_id) FROM project_requirement WHERE project_name = 'name project' AND required_hours = 300", 'SELECT * FROM students WHERE age > 18;', "SELECT elimination_time FROM wrestler WHERE wrestler_name IN ('Punk', 'Orton')", 'SELECT name, department, credit FROM table_name', "SELECT COUNT(*) FROM participants WHERE type = 'organizer'", 'SELECT MAX(minimum_settlement_amount) FROM records']
['SELECT order_item_id FROM order_items WHERE product_id = 11', 'SELECT Low_Estimate ,  High_Estimate FROM film_market_estimation', "SELECT cust_name ,  acc_bal FROM customer WHERE cust_name LIKE '%a%'", 'SELECT subject_name FROM SUBJECTS', 'SELECT catalog_entry_name FROM catalog_contents ORDER BY price_in_dollars DESC LIMIT 1', 'SELECT T1.Product_Name FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID GROUP BY T1.Product_Name HAVING COUNT(*)  >=  2', 'SELECT T1.name FROM club AS T1 JOIN player AS T2 ON T1.Club_ID  =  T2.Club_ID WHERE T2.Position  =  "Right Wing"', 'SELECT count(*) FROM Ref_budget_codes', 'SELECT DISTINCT T2.name FROM undergoes AS T1 JOIN patient AS T2 ON T1.patient = T2.SSN JOIN stay AS T3 ON T1.Stay  =  T3.StayID WHERE T3.room  =  111', 'SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T2.uid  =  T1.Airline WHERE T2.Airline  =  "United Airlines"', 'SELECT * FROM employees WHERE salary BETWEEN 8000 AND 12000 AND commission_pct != "null" OR  department_id != 40', 'SELECT match_id FROM MATCH WHERE competition = "1994 FIFA World Cup qualification"', 'SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)', 'SELECT cost_of_treatment FROM Treatments ORDER BY date_of_treatment DESC LIMIT 1', 'SELECT role_code ,  count(*) FROM Employees GROUP BY role_code', 'SELECT Accreditation_level FROM phone GROUP BY Accreditation_level HAVING count(*)  >  3', 'SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1', 'SELECT user_name ,  password FROM users GROUP BY role_code ORDER BY count(*) DESC LIMIT 1', 'SELECT count(DISTINCT POSITION) FROM player', 'SELECT Product_Type_Code FROM Products GROUP BY Product_Type_Code HAVING COUNT(*)  >=  2', 'SELECT T2.name FROM assignedto AS T1 JOIN scientists AS T2 ON T1.scientist  =  T2.ssn', 'SELECT Name FROM pilot WHERE Age  >=  25', 'SELECT T1.statement_id ,  T2.statement_details ,  T1.account_details FROM Accounts AS T1 JOIN Statements AS T2 ON T1.statement_id  =  T2.statement_id', 'SELECT Roles.role_description , count(Employees.employee_id) FROM ROLES JOIN Employees ON Employees.role_code = Roles.role_code GROUP BY Employees.role_code HAVING count(Employees.employee_id)  >  1;', 'SELECT email_address ,  date_of_birth FROM Customers WHERE first_name = "Carole"', "SELECT T1.name FROM instructor AS T1 JOIN teaches AS T2 ON T1.id  =  T2.id JOIN course AS T3 ON T2.course_id  =  T3.course_id WHERE T3.title  =  'C Programming'", 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33', 'SELECT count(*) FROM Video_games WHERE gtype  =  "Massively multiplayer online game"', "SELECT emp_fname FROM employee WHERE emp_jobcode  =  'PROF' EXCEPT SELECT T1.emp_fname FROM employee AS T1 JOIN CLASS AS T2 ON T1.emp_num  =  T2.prof_num", 'SELECT avg(enrollment) FROM university WHERE founded  <  1850', 'SELECT T3.location FROM station_company AS T1 JOIN company AS T2 ON T1.company_id  =  T2.company_id JOIN gas_station AS T3 ON T1.station_id  =  T3.station_id WHERE T2.market_value  >  100', 'SELECT T2.name FROM train_station AS T1 JOIN train AS T2 ON T1.train_id  =  T2.train_id WHERE T1.station_id NOT IN (SELECT T4.station_id FROM train_station AS T3 JOIN station AS T4 ON T3.station_id  =  T4.station_id WHERE t4.location  =  "London")', 'SELECT Nationality ,  COUNT(*) FROM HOST GROUP BY Nationality', 'SELECT T2.name ,  avg(T1.stars) FROM Rating AS T1 JOIN Reviewer AS T2 ON T1.rID  =  T2.rID GROUP BY T2.name', 'SELECT template_id ,  version_number ,  template_type_code FROM Templates', 'SELECT customer_status_code , count(*) FROM Customers GROUP BY customer_status_code;', 'SELECT Country_name ,  Capital FROM country', 'SELECT avg(Enrollment) FROM school', 'SELECT avg(age) ,  sex FROM Student GROUP BY sex', 'SELECT count(*) FROM entrepreneur', "SELECT first_name ,  department_id FROM employees WHERE last_name  =  'McEwen'", 'SELECT firstname FROM teachers WHERE classroom  =  110', 'SELECT T1.first_name ,  T1.middle_name ,  T1.last_name ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING count(*)  =  2', "SELECT T3.amenity_name FROM dorm AS T1 JOIN has_amenity AS T2 ON T1.dormid  =  T2.dormid JOIN dorm_amenity AS T3 ON T2.amenid  =  T3.amenid JOIN lives_in AS T4 ON T4.dormid  =  T1.dormid JOIN student AS T5 ON T5.stuid  =  T4.stuid WHERE T5.lname  =  'Smith'", 'SELECT count(*) ,  T1.name FROM projects AS T1 JOIN assignedto AS T2 ON T1.code  =  T2.project WHERE T1.hours  >  300 GROUP BY T1.name', 'SELECT StuID FROM Student WHERE age  =  (SELECT max(age) FROM Student)', 'SELECT TIME FROM elimination WHERE Eliminated_By  =  "Punk" OR Eliminated_By  =  "Orton"', 'SELECT dept_name FROM course GROUP BY dept_name ORDER BY sum(credits) DESC LIMIT 1', "SELECT count(*) FROM participants WHERE participant_type_code  =  'Organizer'", 'SELECT max(settlement_amount) ,  min(settlement_amount) FROM settlements']

In [33]:
import re
import numpy as np
import evaluate  # pip install evaluate
from collections import Counter

# ---------- Normalization ----------
def normalize(sql): 
    sql = re.sub(r"\s+", " ", sql)   # collapse whitespace
    sql = sql.strip().lower()
    sql = re.sub(r";$", "", sql)     # remove trailing semicolon
    return sql

# ---------- Token-level F1 ----------
def token_f1(pred, ref):
    p_tokens, r_tokens = pred.split(), ref.split()
    p_count, r_count = Counter(p_tokens), Counter(r_tokens)
    common = sum((p_count & r_count).values())
    if not p_tokens or not r_tokens:
        return 0.0
    precision = common / len(p_tokens)
    recall = common / len(r_tokens)
    if precision + recall == 0:
        return 0.0
    return 2 * precision * recall / (precision + recall)

# ---------- Clause-level Match ----------
def clause_match(pred, ref, clause="where"):
    pred_has = clause in pred.lower()
    ref_has = clause in ref.lower()
    return pred_has == ref_has

def clause_scores(preds, refs):
    clauses = ["select", "from", "where", "group by", "order by"]
    results = {}
    for cl in clauses:
        acc = np.mean([clause_match(p, g, clause=cl) for p, g in zip(preds, refs)])
        results[cl.upper()] = acc
    return results

# ---------- Partial Match (columns/tables overlap) ----------
def partial_match(pred, ref):
    cols_ref = re.findall(r"[a-zA-Z_][a-zA-Z0-9_]*", ref.lower())
    cols_pred = re.findall(r"[a-zA-Z_][a-zA-Z0-9_]*", pred.lower())
    overlap = len(set(cols_ref) & set(cols_pred))
    return overlap / max(1, len(set(cols_ref)))

# ---------- Compute Metrics ----------
preds_norm = [normalize(p) for p in preds]
refs_norm = [normalize(r) for r in refs]

# Exact Match
exact_match = np.mean([p == g for p, g in zip(preds_norm, refs_norm)])

# BLEU
bleu = evaluate.load("sacrebleu")
bleu_score = bleu.compute(predictions=preds_norm, references=[[r] for r in refs_norm])["score"]

# Token-level F1
f1_scores = [token_f1(p, g) for p, g in zip(preds_norm, refs_norm)]
avg_f1 = np.mean(f1_scores)

# Clause accuracy
clause_acc = clause_scores(preds_norm, refs_norm)

# Partial match
partial_scores = [partial_match(p, g) for p, g in zip(preds_norm, refs_norm)]
avg_partial = np.mean(partial_scores)

# ---------- Print Summary ----------
print("Evaluation Summary:")
print(f"  Exact Match: {exact_match:.3f}")
print(f"  BLEU: {bleu_score:.2f}")
print(f"  Token F1: {avg_f1:.3f}")
print(f"  Partial Match: {avg_partial:.3f}")
print("  Clause Accuracy:")
for cl, acc in clause_acc.items():
    print(f"    {cl}: {acc:.3f}")

# ---------- Preview Examples ----------
for q, g, p, f1, pm in zip(val_df["text_query"].head(50), refs_norm[:50], preds_norm[:50], f1_scores[:50], partial_scores[:50]):
    print("\n---")
    print("Q:", q)
    print("Gold:", g)
    print("Pred:", p)
    print(f"Token F1: {f1:.3f} | Partial Match: {pm:.3f}")

Evaluation Summary:
  Exact Match: 0.020
  BLEU: 18.24
  Token F1: 0.470
  Partial Match: 0.564
  Clause Accuracy:
    SELECT: 1.000
    FROM: 1.000
    WHERE: 0.820
    GROUP BY: 0.820
    ORDER BY: 0.920

---
Q: Find the ids of all the order items whose product id is 11.
Gold: select order_item_id from order_items where product_id = 11
Pred: select id from order_item where product_id = 11
Token F1: 0.750 | Partial Match: 0.667

---
Q: Return the low and high estimates for all film markets.
Gold: select low_estimate , high_estimate from film_market_estimation
Pred: select min(estimate) as low, max(estimate) as high from film_market
Token F1: 0.267 | Partial Match: 0.400

---
Q: Find the name and account balance of the customer whose name includes the letter ‘a’.
Gold: select cust_name , acc_bal from customer where cust_name like '%a%'
Pred: select name, account_balance from customer where name like '% %'
Token F1: 0.500 | Partial Match: 0.625

---
Q: What are the names of all the subjects.
Gold: select subject_name from subjects
Pred: select name, subject from table_name
Token F1: 0.444 | Partial Match: 0.500

---
Q: Find the entry name of the catalog with the highest price (in USD).
Gold: select catalog_entry_name from catalog_contents order by price_in_dollars desc limit 1
Pred: select entry_name from catalog where price_usd = ( select max(price_usd) from catalog )
Token F1: 0.174 | Partial Match: 0.222

---
Q: Show the names of products that are in at least two events.
Gold: select t1.product_name from products as t1 join products_in_events as t2 on t1.product_id = t2.product_id group by t1.product_name having count(*) >= 2
Pred: select name from product where id in (select product_id from event group by product_id having count(distinct event_id) >= 2)
Token F1: 0.300 | Partial Match: 0.467

---
Q: What are the names of the clubs that have players in the position of "Right Wing"?
Gold: select t1.name from club as t1 join player as t2 on t1.club_id = t2.club_id where t2.position = "right wing"
Pred: select name from club_player where position = "right wing"
Token F1: 0.429 | Partial Match: 0.467

---
Q: Count the number of budget codes.
Gold: select count(*) from ref_budget_codes
Pred: select count(distinct budget_code) from table_name
Token F1: 0.444 | Partial Match: 0.750

---
Q: What are the names of patients who are staying in room 111 and have an undergoing treatment?
Gold: select distinct t2.name from undergoes as t1 join patient as t2 on t1.patient = t2.ssn join stay as t3 on t1.stay = t3.stayid where t3.room = 111
Pred: select name from patient where room = 111 and treatment is not null
Token F1: 0.300 | Partial Match: 0.353

---
Q: Which flight numbers correspond to United Airlines flights?
Gold: select t1.flightno from flights as t1 join airlines as t2 on t2.uid = t1.airline where t2.airline = "united airlines"
Pred: select flight_number from flights where airline = 'united airlines'
Token F1: 0.357 | Partial Match: 0.500

---
Q: Return all information about employees with salaries between 8000 and 12000 for which commission is not null or where their department id is not 40.
Gold: select * from employees where salary between 8000 and 12000 and commission_pct != "null" or department_id != 40
Pred: select * from employees where salary between 8000 and 12000 and commission is null and department_id = 40
Token F1: 0.722 | Partial Match: 0.818

---
Q: What is the match id of the competition called "1994 FIFA World Cup qualification"?
Gold: select match_id from match where competition = "1994 fifa world cup qualification"
Pred: select * from competitions where name = "1994 fifa world cup qualification"
Token F1: 0.750 | Partial Match: 0.700

---
Q: List all song names by singers above the average age.
Gold: select song_name from singer where age > (select avg(age) from singer)
Pred: select song_name, singer, avg(age) from singers join songs on singers.singer_id = songs.singer_id group by song_name, singer
Token F1: 0.296 | Partial Match: 0.857

---
Q: How much does the most recent treatment cost?
Gold: select cost_of_treatment from treatments order by date_of_treatment desc limit 1
Pred: select max(cost) from treatments where date = (select max(date) from treatments)
Token F1: 0.286 | Partial Match: 0.333

---
Q: What is the code of each role and the number of employees in each role?
Gold: select role_code , count(*) from employees group by role_code
Pred: select code, role from employees where role = 'employee'
Token F1: 0.333 | Partial Match: 0.429

---
Q: Find the accreditation level that more than 3 phones use.
Gold: select accreditation_level from phone group by accreditation_level having count(*) > 3
Pred: select phone from table_name where accreditation_level = 3
Token F1: 0.526 | Partial Match: 0.500

---
Q: What are the names of conductors who have conducted at more than one orchestra?
Gold: select t1.name from conductor as t1 join orchestra as t2 on t1.conductor_id = t2.conductor_id group by t2.conductor_id having count(*) > 1
Pred: select name from conductors where orchestra_count = 1
Token F1: 0.276 | Partial Match: 0.200

---
Q: What are the usernames and passwords of users that have the most common role?
Gold: select user_name , password from users group by role_code order by count(*) desc limit 1
Pred: select username, password, user, common, role from users
Token F1: 0.261 | Partial Match: 0.333

---
Q: how many different positions are there?
Gold: select count(distinct position) from player
Pred: select count(distinct position) from table_name
Token F1: 0.800 | Partial Match: 0.833

---
Q: Show the product type codes that have at least two products.
Gold: select product_type_code from products group by product_type_code having count(*) >= 2
Pred: select product_type_code from products group by product_type_code having count(distinct product_id) >= 2
Token F1: 0.870 | Partial Match: 1.000

---
Q: Find the name of scientists who are assigned to some project.
Gold: select t2.name from assignedto as t1 join scientists as t2 on t1.scientist = t2.ssn
Pred: select name from scientists where project is not null
Token F1: 0.261 | Partial Match: 0.333

---
Q: what is the name of every pilot who is at least 25 years old?
Gold: select name from pilot where age >= 25
Pred: select name from pilots where age >= 25
Token F1: 0.875 | Partial Match: 0.833

---
Q: What are the statement ids, statement details, and account details, for all accounts?
Gold: select t1.statement_id , t2.statement_details , t1.account_details from accounts as t1 join statements as t2 on t1.statement_id = t2.statement_id
Pred: select statement_id, statement_detail, account_detail, account from statement_table
Token F1: 0.160 | Partial Match: 0.250

---
Q: List roles that have more than one employee. List the role description and number of employees.
Gold: select roles.role_description , count(employees.employee_id) from roles join employees on employees.role_code = roles.role_code group by employees.role_code having count(employees.employee_id) > 1
Pred: select role, count(*) as number_of_employees from employees group by role
Token F1: 0.345 | Partial Match: 0.462

---
Q: What are the email addresses and date of births for all customers who have a first name of Carole?
Gold: select email_address , date_of_birth from customers where first_name = "carole"
Pred: select email_address from customers where first_name = 'carole' and date_of_birth is not null
Token F1: 0.696 | Partial Match: 1.000

---
Q: Find the name of the instructors who taught C Programming course before.
Gold: select t1.name from instructor as t1 join teaches as t2 on t1.id = t2.id join course as t3 on t2.course_id = t3.course_id where t3.title = 'c programming'
Pred: select name from instructor where course='c programming'
Token F1: 0.294 | Partial Match: 0.444

---
Q: What are the names of the teachers who are aged either 32 or 33?
Gold: select name from teacher where age = 32 or age = 33
Pred: select name from teacher where age in (32, 33)
Token F1: 0.571 | Partial Match: 0.857

---
Q: How many video games have type Massively multiplayer online game?
Gold: select count(*) from video_games where gtype = "massively multiplayer online game"
Pred: select count(*) from video_games where type = 'massively multiplayer online game'
Token F1: 0.727 | Partial Match: 0.900

---
Q: What are the first names of all professors not teaching any classes?
Gold: select emp_fname from employee where emp_jobcode = 'prof' except select t1.emp_fname from employee as t1 join class as t2 on t1.emp_num = t2.prof_num
Pred: select first_name from professors where id in (select professor_id from classes)
Token F1: 0.235 | Partial Match: 0.188

---
Q: Return the average enrollment of universities founded before 1850.
Gold: select avg(enrollment) from university where founded < 1850
Pred: select avg(enrollment) from university where founding_year = 1850
Token F1: 0.750 | Partial Match: 0.857

---
Q: Show all locations where a gas station for company with market value greater than 100 is located.
Gold: select t3.location from station_company as t1 join company as t2 on t1.company_id = t2.company_id join gas_station as t3 on t1.station_id = t3.station_id where t2.market_value > 100
Pred: select location from gas_station_company where market_value > 100
Token F1: 0.294 | Partial Match: 0.312

---
Q: Find the names of the trains that do not pass any station located in London.
Gold: select t2.name from train_station as t1 join train as t2 on t1.train_id = t2.train_id where t1.station_id not in (select t4.station_id from train_station as t3 join station as t4 on t3.station_id = t4.station_id where t4.location = "london")
Pred: select name from train where station_location = 'london'
Token F1: 0.227 | Partial Match: 0.300

---
Q: How many hosts does each nationality have? List the nationality and the count.
Gold: select nationality , count(*) from host group by nationality
Pred: select nationality, count(*) from hosts group by nationality
Token F1: 0.706 | Partial Match: 0.857

---
Q: What is the average rating star for each reviewer?
Gold: select t2.name , avg(t1.stars) from rating as t1 join reviewer as t2 on t1.rid = t2.rid group by t2.name
Pred: select avg(rating) from reviewer
Token F1: 0.261 | Partial Match: 0.333

---
Q: What are the ids, version numbers, and type codes for each template?
Gold: select template_id , version_number , template_type_code from templates
Pred: select id, version, type, code, template from table_name
Token F1: 0.250 | Partial Match: 0.333

---
Q: For each customer status code, how many customers are classified that way?
Gold: select customer_status_code , count(*) from customers group by customer_status_code
Pred: select customer_status_code, count(classify_way) as num_classify_ways from customer_classifications group by customer_status_code
Token F1: 0.526 | Partial Match: 0.857

---
Q: What are the names and capitals of each country?
Gold: select country_name , capital from country
Pred: select name, capital, country from countries
Token F1: 0.500 | Partial Match: 0.800

---
Q: What is the average enrollment of schools?
Gold: select avg(enrollment) from school
Pred: select avg(enrollment) from school
Token F1: 1.000 | Partial Match: 1.000

---
Q: What are the average ages for male and female students?
Gold: select avg(age) , sex from student group by sex
Pred: select avg(age) from students group by gender
Token F1: 0.625 | Partial Match: 0.750

---
Q: How many entrepreneurs are there?
Gold: select count(*) from entrepreneur
Pred: select count(*) from entrepreneurs
Token F1: 0.750 | Partial Match: 0.750

---
Q: Display the first name, and department number for all employees whose last name is "McEwen".
Gold: select first_name , department_id from employees where last_name = 'mcewen'
Pred: select firstname, deptno from emp where lastname = 'mcewen'
Token F1: 0.526 | Partial Match: 0.500

---
Q: Which teachers teach in classroom 110? Give me their first names.
Gold: select firstname from teachers where classroom = 110
Pred: select first_name from teacher where classroom = 110
Token F1: 0.750 | Partial Match: 0.667

---
Q: What are the first, middle, and last names, along with the ids, of all students who enrolled in 2 degree programs in one semester?
Gold: select t1.first_name , t1.middle_name , t1.last_name , t1.student_id from students as t1 join student_enrolment as t2 on t1.student_id = t2.student_id group by t1.student_id having count(*) = 2
Pred: select first_name, middle_name, last_name, id from students where degree_program = 2 and semester = 1
Token F1: 0.286 | Partial Match: 0.353

---
Q: Find the name of amenities of the dorm where the student with last name Smith is living in.
Gold: select t3.amenity_name from dorm as t1 join has_amenity as t2 on t1.dormid = t2.dormid join dorm_amenity as t3 on t2.amenid = t3.amenid join lives_in as t4 on t4.dormid = t1.dormid join student as t5 on t5.stuid = t4.stuid where t5.lname = 'smith'
Pred: select s.name, a.amenity from students s join dorms d on s.dorm_id = d.id join amenities a on d.amenity_id = a.id where s.last_name = 'smith'
Token F1: 0.333 | Partial Match: 0.273

---
Q: What are the names of projects that require more than 300 hours, and how many scientists are assigned to each?
Gold: select count(*) , t1.name from projects as t1 join assignedto as t2 on t1.code = t2.project where t1.hours > 300 group by t1.name
Pred: select count(assign_scientist_id) from project_requirement where project_name = 'name project' and required_hours = 300
Token F1: 0.278 | Partial Match: 0.353

---
Q: Show the student id of the oldest student.
Gold: select stuid from student where age = (select max(age) from student)
Pred: select * from students where age > 18
Token F1: 0.421 | Partial Match: 0.571

---
Q: Show the times of elimination by "Punk" or "Orton".
Gold: select time from elimination where eliminated_by = "punk" or eliminated_by = "orton"
Pred: select elimination_time from wrestler where wrestler_name in ('punk', 'orton')
Token F1: 0.286 | Partial Match: 0.556

---
Q: What is the name of the department with the most credits?
Gold: select dept_name from course group by dept_name order by sum(credits) desc limit 1
Pred: select name, department, credit from table_name
Token F1: 0.211 | Partial Match: 0.182

---
Q: How many participants belong to the type 'Organizer'?
Gold: select count(*) from participants where participant_type_code = 'organizer'
Pred: select count(*) from participants where type = 'organizer'
Token F1: 0.875 | Partial Match: 0.857

---
Q: What are the maximum and minimum settlement amount on record?
Gold: select max(settlement_amount) , min(settlement_amount) from settlements
Pred: select max(minimum_settlement_amount) from records
Token F1: 0.400 | Partial Match: 0.500